#!/bin/bash
#################################################################################
# حق نشر 1392-1402 دانش پژوهان ققنوس
# حقوق این اثر محفوظ است.
# 
# استفاده مجدد از متن و یا نتایج این اثر در هر شکل غیر قانونی است مگر اینکه متن حق
# نشر بالا در ابتدای تمامی مستندهای و یا برنامه‌های به دست آمده از این اثر
# بازنویسی شود. این کار باید برای تمامی مستندها، متنهای تبلیغاتی برنامه‌های
# کاربردی و سایر مواردی که از این اثر به دست می‌آید مندرج شده و در قسمت تقدیر از
# صاحب این اثر نام برده شود.
# 
# نام گروه دانش پژوهان ققنوس ممکن است در محصولات به در آمده شده از این اثر درج
# نشود که در این حالت با مطالبی که در بالا اورده شده در تضاد نیست. برای اطلاع
# بیشتر در مورد حق نشر آدرس زیر مراجعه کنید:
# 
# http://dpq.co.ir/licence
#################################################################################


function boostan_log(){
	if [ "$BOOSTAN_VERBOSE" = true ] ; then
		printf "[Boostan $BOOSTAN_VERSION] "
		printf "$@"
		printf "\n"
	fi
}

function boostan_log_print(){
	printf "| %20s | %110s |\n" "$1" "$2"
}

function boostan_log_print_header(){
	for((i=0;i<137;i++));
	do
	    printf "-"
	done
	printf "\n"
	
	if [ -z "$VAR" ]; then
		# Check if header exist
		printf "| %130s |\n" "$1"
		for((i=0;i<137;i++));
		do
		    printf "-"
		done
		printf "\n"
	fi
}

function boostan_log_print_footer(){
	for((i=0;i<137;i++));
	do
	    printf "-"
	done
	printf "\n"
}